polls_app/app/models/response.rb

INSERT INTO "responses" ("user_id", "created_at", "updated_at", "answer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 16], ["created_at", "2018-10-11 20:39:34.813649"], ["updated_at", "2018-10-11 20:39:34.813649"], ["answer_id", 12]]
---
  def self.record_response(user, answer)
    Response.create!(user_id: user.id, answer_id: answer.id)